package com.devcolibri;

/**
 * Created by Vasily on 2/8/2017.
 * Написать консольную программу, которая при помощи цикла while печатает на консоли числа от 0 до 100.
 */
public class javaguru_04_dz_1_from_0_to_100 {
    public static void main(String[] args) {
        int  i = 0;
       while(i <= 100){
           System.out.println(i);
           i++;
       }
    }
}
